PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16lf1579.inc
;----- PWM3INTCON Bits -----------------------------------------------------
PRIE             EQU  H'0000'
DCIE             EQU  H'0001'
PHIE             EQU  H'0002'
OFIE             EQU  H'0003'

PWM3PRIE         EQU  H'0000'
PWM3DCIE         EQU  H'0001'
PWM3PHIE         EQU  H'0002'
PWM3OFIE         EQU  H'0003'


;----- PWM3INTE Bits -----------------------------------------------------
PRIE             EQU  H'0000'
DCIE             EQU  H'0001'
PHIE             EQU  H'0002'
OFIE             EQU  H'0003'

PWM3PRIE         EQU  H'0000'
PWM3DCIE         EQU  H'0001'
PWM3PHIE         EQU  H'0002'
PWM3OFIE         EQU  H'0003'


;----- PWM3INTF Bits -----------------------------------------------------
PRIF             EQU  H'0000'
DCIF             EQU  H'0001'
PHIF             EQU  H'0002'
OFIF             EQU  H'0003'

PWM3PRIF         EQU  H'0000'
PWM3DCIF         EQU  H'0001'
PWM3PHIF         EQU  H'0002'
PWM3OFIF         EQU  H'0003'


;----- PWM3INTFLG Bits -----------------------------------------------------
PRIF             EQU  H'0000'
DCIF             EQU  H'0001'
PHIF             EQU  H'0002'
OFIF             EQU  H'0003'

PWM3PRIF         EQU  H'0000'
PWM3DCIF         EQU  H'0001'
PWM3PHIF         EQU  H'0002'
PWM3OFIF         EQU  H'0003'


;----- PWM3CLKCON Bits -----------------------------------------------------
PWM3CS0          EQU  H'0000'
PWM3CS1          EQU  H'0001'
PWM3PS0          EQU  H'0004'
PWM3PS1          EQU  H'0005'
PWM3PS2          EQU  H'0006'


CS0              EQU  H'0000'
CS1              EQU  H'0001'
PS0_PWM3CLKCON   EQU  H'0004'
PS1_PWM3CLKCON   EQU  H'0005'
PS2_PWM3CLKCON   EQU  H'0006'


;----- PWM3LDCON Bits -----------------------------------------------------
LDT              EQU  H'0006'
LDA              EQU  H'0007'

PWM3LDS0         EQU  H'0000'
PWM3LDS1         EQU  H'0001'

PWM3LDM          EQU  H'0006'
PWM3LD           EQU  H'0007'

LDS0             EQU  H'0000'
LDS1             EQU  H'0001'


;----- PWM3OFCON Bits -----------------------------------------------------
OFO              EQU  H'0004'

PWM3OFS0         EQU  H'0000'
PWM3OFS1         EQU  H'0001'
PWM3OFM0         EQU  H'0005'
PWM3OFM1         EQU  H'0006'

PWM3OFMC         EQU  H'0004'

OFS0             EQU  H'0000'
OFS1             EQU  H'0001'
OFM0             EQU  H'0005'
OFM1             EQU  H'0006'


;----- PWM4PHL Bits -----------------------------------------------------
PWM4PHL0         EQU  H'0000'
PWM4PHL1         EQU  H'0001'
PWM4PHL2         EQU  H'0002'
PWM4PHL3         EQU  H'0003'
PWM4PHL4         EQU  H'0004'
PWM4PHL5         EQU  H'0005'
PWM4PHL6         EQU  H'0006'
PWM4PHL7         EQU  H'0007'



;----- PWM4PHH Bits -----------------------------------------------------
PWM4PHH0         EQU  H'0000'
PWM4PHH1         EQU  H'0001'
PWM4PHH2         EQU  H'0002'
PWM4PHH3         EQU  H'0003'
PWM4PHH4         EQU  H'0004'
PWM4PHH5         EQU  H'0005'
PWM4PHH6         EQU  H'0006'
PWM4PHH7         EQU  H'0007'



;----- PWM4DCL Bits -----------------------------------------------------
PWM4DCL0         EQU  H'0000'
PWM4DCL1         EQU  H'0001'
PWM4DCL2         EQU  H'0002'
PWM4DCL3         EQU  H'0003'
PWM4DCL4         EQU  H'0004'
PWM4DCL5         EQU  H'0005'
PWM4DCL6         EQU  H'0006'
PWM4DCL7         EQU  H'0007'



;----- PWM4DCH Bits -----------------------------------------------------
PWM4DCH0         EQU  H'0000'
PWM4DCH1         EQU  H'0001'
PWM4DCH2         EQU  H'0002'
PWM4DCH3         EQU  H'0003'
PWM4DCH4         EQU  H'0004'
PWM4DCH5         EQU  H'0005'
PWM4DCH6         EQU  H'0006'
PWM4DCH7         EQU  H'0007'



;----- PWM4PRL Bits -----------------------------------------------------
PWM4PRL0         EQU  H'0000'
PWM4PRL1         EQU  H'0001'
PWM4PRL2         EQU  H'0002'
PWM4PRL3         EQU  H'0003'
PWM4PRL4         EQU  H'0004'
PWM4PRL5         EQU  H'0005'
PWM4PRL6         EQU  H'0006'
PWM4PRL7         EQU  H'0007'



;----- PWM4PRH Bits -----------------------------------------------------
PWM4PRH0         EQU  H'0000'
PWM4PRH1         EQU  H'0001'
PWM4PRH2         EQU  H'0002'
PWM4PRH3         EQU  H'0003'
PWM4PRH4         EQU  H'0004'
PWM4PRH5         EQU  H'0005'
PWM4PRH6         EQU  H'0006'
PWM4PRH7         EQU  H'0007'



;----- PWM4OFL Bits -----------------------------------------------------
PWM4OFL0         EQU  H'0000'
PWM4OFL1         EQU  H'0001'
PWM4OFL2         EQU  H'0002'
PWM4OFL3         EQU  H'0003'
PWM4OFL4         EQU  H'0004'
PWM4OFL5         EQU  H'0005'
PWM4OFL6         EQU  H'0006'
PWM4OFL7         EQU  H'0007'



;----- PWM4OFH Bits -----------------------------------------------------
PWM4OFH0         EQU  H'0000'
PWM4OFH1         EQU  H'0001'
PWM4OFH2         EQU  H'0002'
PWM4OFH3         EQU  H'0003'
PWM4OFH4         EQU  H'0004'
PWM4OFH5         EQU  H'0005'
PWM4OFH6         EQU  H'0006'
PWM4OFH7         EQU  H'0007'



;----- PWM4TMRL Bits -----------------------------------------------------
PWM4TMRL0        EQU  H'0000'
PWM4TMRL1        EQU  H'0001'
PWM4TMRL2        EQU  H'0002'
PWM4TMRL3        EQU  H'0003'
PWM4TMRL4        EQU  H'0004'
PWM4TMRL5        EQU  H'0005'
PWM4TMRL6        EQU  H'0006'
PWM4TMRL7        EQU  H'0007'



;----- PWM4TMRH Bits -----------------------------------------------------
PWM4TMRH0        EQU  H'0000'
PWM4TMRH1        EQU  H'0001'
PWM4TMRH2        EQU  H'0002'
PWM4TMRH3        EQU  H'0003'
PWM4TMRH4        EQU  H'0004'
PWM4TMRH5        EQU  H'0005'
PWM4TMRH6        EQU  H'0006'
PWM4TMRH7        EQU  H'0007'



;----- PWM4CON Bits -----------------------------------------------------
POL              EQU  H'0004'
OUT              EQU  H'0005'
OE               EQU  H'0006'
EN               EQU  H'0007'

PWM4MODE0        EQU  H'0002'
PWM4MODE1        EQU  H'0003'

PWM4POL          EQU  H'0004'
PWM4OUT          EQU  H'0005'
PWM4OE           EQU  H'0006'
PWM4EN           EQU  H'0007'

MODE0            EQU  H'0002'
MODE1            EQU  H'0003'


;----- PWM4INTCON Bits -----------------------------------------------------
PRIE             EQU  H'0000'
DCIE             EQU  H'0001'
PHIE             EQU  H'0002'
OFIE             EQU  H'0003'

PWM4PRIE         EQU  H'0000'
PWM4DCIE         EQU  H'0001'
PWM4PHIE         EQU  H'0002'
PWM4OFIE         EQU  H'0003'


;----- PWM4INTE Bits -----------------------------------------------------
PRIE             EQU  H'0000'
DCIE             EQU  H'0001'
PHIE             EQU  H'0002'
OFIE             EQU  H'0003'

PWM4PRIE         EQU  H'0000'
PWM4DCIE         EQU  H'0001'
PWM4PHIE         EQU  H'0002'
PWM4OFIE         EQU  H'0003'


;----- PWM4INTF Bits -----------------------------------------------------
PRIF             EQU  H'0000'
DCIF             EQU  H'0001'
PHIF             EQU  H'0002'
OFIF             EQU  H'0003'

PWM4PRIF         EQU  H'0000'
PWM4DCIF         EQU  H'0001'
PWM4PHIF         EQU  H'0002'
PWM4OFIF         EQU  H'0003'


